sysbench/output_64/cacheline64/oltp-rw.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 108.55 qps: 2174.84 (r/w/o: 1522.53/435.01/217.30) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 124.21 qps: 2482.37 (r/w/o: 1737.92/496.03/248.42) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 120.80 qps: 2414.02 (r/w/o: 1689.41/483.20/241.40) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 111.60 qps: 2235.80 (r/w/o: 1565.20/447.20/223.40) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 104.40 qps: 2088.01 (r/w/o: 1461.60/417.60/208.80) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 113.80 qps: 2275.40 (r/w/o: 1593.20/454.60/227.60) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 109.80 qps: 2193.20 (r/w/o: 1534.60/439.00/219.60) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 115.80 qps: 2319.40 (r/w/o: 1623.80/464.00/231.60) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 113.80 qps: 2276.01 (r/w/o: 1593.21/455.20/227.60) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 112.20 qps: 2244.00 (r/w/o: 1570.80/448.80/224.40) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 118.60 qps: 2371.98 (r/w/o: 1660.39/474.40/237.20) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 116.00 qps: 2319.82 (r/w/o: 1624.01/463.80/232.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            95886
        write:                           27396
        other:                           13698
        total:                           136980
    transactions:                        6849   (114.14 per sec.)
    queries:                             136980 (2282.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      114.1367
    time elapsed:                        60.0070s
    total number of events:              6849

Latency (ms):
         min:                                    5.12
         avg:                                    8.76
         max:                                  119.61
         95th percentile:                       13.22
         sum:                                59985.12

Threads fairness:
    events (avg/stddev):           6849.0000/0.00
    execution time (avg/stddev):   59.9851/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 209.72 qps: 4201.90 (r/w/o: 2941.61/840.46/419.83) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 209.01 qps: 4179.15 (r/w/o: 2925.91/835.23/418.02) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 210.80 qps: 4215.37 (r/w/o: 2950.58/843.19/421.60) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 207.00 qps: 4141.68 (r/w/o: 2898.85/828.82/414.01) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 218.40 qps: 4367.99 (r/w/o: 3057.59/873.60/436.80) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 216.39 qps: 4325.96 (r/w/o: 3028.43/864.75/432.78) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 198.81 qps: 3978.05 (r/w/o: 2784.37/796.05/397.62) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 198.80 qps: 3975.18 (r/w/o: 2783.19/794.40/397.60) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 216.20 qps: 4323.59 (r/w/o: 3026.39/864.80/432.40) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 215.60 qps: 4311.81 (r/w/o: 3018.20/862.40/431.20) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 218.18 qps: 4364.02 (r/w/o: 3054.93/872.72/436.36) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 209.61 qps: 4191.85 (r/w/o: 2934.18/838.45/419.23) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            177030
        write:                           50580
        other:                           25290
        total:                           252900
    transactions:                        12645  (210.72 per sec.)
    queries:                             252900 (4214.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      210.7184
    time elapsed:                        60.0090s
    total number of events:              12645

Latency (ms):
         min:                                    5.59
         avg:                                    9.49
         max:                                  229.41
         95th percentile:                       13.95
         sum:                               119971.65

Threads fairness:
    events (avg/stddev):           6322.5000/7.50
    execution time (avg/stddev):   59.9858/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 376.63 qps: 7547.84 (r/w/o: 5284.05/1509.73/754.06) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 359.41 qps: 7188.26 (r/w/o: 5031.78/1437.65/718.83) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 365.80 qps: 7313.77 (r/w/o: 5119.78/1462.39/731.60) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 353.71 qps: 7068.58 (r/w/o: 4947.93/1413.24/707.42) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 359.71 qps: 7200.13 (r/w/o: 5040.29/1440.43/719.41) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 362.18 qps: 7244.66 (r/w/o: 5071.56/1448.73/724.37) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 349.80 qps: 6994.56 (r/w/o: 4896.57/1398.39/699.60) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 325.42 qps: 6510.53 (r/w/o: 4556.43/1303.27/650.83) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 365.38 qps: 7305.53 (r/w/o: 5114.27/1460.51/730.75) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 364.80 qps: 7295.87 (r/w/o: 5106.85/1459.41/729.61) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 359.81 qps: 7197.50 (r/w/o: 5038.61/1439.26/719.63) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 367.60 qps: 7352.92 (r/w/o: 5146.54/1471.18/735.19) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            301784
        write:                           86224
        other:                           43112
        total:                           431120
    transactions:                        21556  (359.22 per sec.)
    queries:                             431120 (7184.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      359.2229
    time elapsed:                        60.0073s
    total number of events:              21556

Latency (ms):
         min:                                    6.06
         avg:                                   11.13
         max:                                   66.51
         95th percentile:                       17.01
         sum:                               239956.31

Threads fairness:
    events (avg/stddev):           5389.0000/15.25
    execution time (avg/stddev):   59.9891/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 540.98 qps: 10839.54 (r/w/o: 7589.68/2166.31/1083.55) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 578.83 qps: 11577.33 (r/w/o: 8103.37/2316.31/1157.65) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 561.82 qps: 11246.06 (r/w/o: 7872.12/2250.29/1123.65) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 570.36 qps: 11391.69 (r/w/o: 7973.90/2277.06/1140.73) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 563.63 qps: 11287.31 (r/w/o: 7901.96/2258.10/1127.25) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 562.80 qps: 11256.39 (r/w/o: 7879.20/2251.60/1125.60) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 566.80 qps: 11336.50 (r/w/o: 7935.27/2267.62/1133.61) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 500.40 qps: 10008.07 (r/w/o: 7005.65/2001.61/1000.81) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 516.78 qps: 10335.63 (r/w/o: 7234.94/2067.13/1033.56) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 583.38 qps: 11655.21 (r/w/o: 8158.13/2330.32/1166.76) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 579.43 qps: 11591.68 (r/w/o: 8116.08/2316.74/1158.87) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 590.21 qps: 11813.50 (r/w/o: 8268.07/2365.02/1180.41) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            470218
        write:                           134348
        other:                           67174
        total:                           671740
    transactions:                        33587  (559.68 per sec.)
    queries:                             671740 (11193.64 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      559.6818
    time elapsed:                        60.0109s
    total number of events:              33587

Latency (ms):
         min:                                    6.62
         avg:                                   14.29
         max:                                  360.85
         95th percentile:                       21.11
         sum:                               479965.00

Threads fairness:
    events (avg/stddev):           4198.3750/16.42
    execution time (avg/stddev):   59.9956/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 761.15 qps: 15283.73 (r/w/o: 10700.84/3057.38/1525.50) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 783.45 qps: 15653.56 (r/w/o: 10960.07/3126.59/1566.90) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 762.40 qps: 15252.97 (r/w/o: 10678.38/3049.79/1524.80) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 738.00 qps: 14770.42 (r/w/o: 10335.42/2959.00/1476.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 743.00 qps: 14837.40 (r/w/o: 10387.60/2964.00/1485.80) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 787.54 qps: 15753.29 (r/w/o: 11027.42/3150.58/1575.29) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 776.92 qps: 15542.24 (r/w/o: 10878.71/3109.69/1553.84) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 662.32 qps: 13260.00 (r/w/o: 9281.28/2654.08/1324.64) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 772.04 qps: 15420.49 (r/w/o: 10796.22/3080.38/1543.89) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 723.57 qps: 14484.23 (r/w/o: 10140.00/2896.89/1447.34) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 784.48 qps: 15676.91 (r/w/o: 10974.86/3133.70/1568.35) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 15 tps: 785.21 qps: 15704.30 (r/w/o: 10988.27/3146.22/1569.81) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            635880
        write:                           181680
        other:                           90840
        total:                           908400
    transactions:                        45420  (756.76 per sec.)
    queries:                             908400 (15135.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      756.7612
    time elapsed:                        60.0189s
    total number of events:              45420

Latency (ms):
         min:                                    6.86
         avg:                                   21.14
         max:                                  247.00
         95th percentile:                       30.81
         sum:                               960045.21

Threads fairness:
    events (avg/stddev):           2838.7500/11.66
    execution time (avg/stddev):   60.0028/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 915.55 qps: 18417.55 (r/w/o: 12899.76/3680.32/1837.47) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 935.84 qps: 18702.21 (r/w/o: 13090.77/3740.16/1871.28) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 933.04 qps: 18660.77 (r/w/o: 13062.74/3731.55/1866.48) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 884.40 qps: 17705.37 (r/w/o: 12395.18/3541.59/1768.60) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 889.39 qps: 17787.11 (r/w/o: 12450.60/3557.54/1778.97) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 919.96 qps: 18401.47 (r/w/o: 12880.49/3681.05/1839.93) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 931.43 qps: 18609.98 (r/w/o: 13025.61/3721.92/1862.46) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 921.21 qps: 18427.25 (r/w/o: 12900.18/3684.25/1842.83) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 788.34 qps: 15768.56 (r/w/o: 11038.93/3152.95/1576.68) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 933.28 qps: 18643.89 (r/w/o: 13048.58/3728.94/1866.37) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 929.40 qps: 18613.62 (r/w/o: 13031.82/3723.00/1858.80) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 31 tps: 946.80 qps: 18884.01 (r/w/o: 13212.41/3781.60/1890.00) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            765394
        write:                           218684
        other:                           109342
        total:                           1093420
    transactions:                        54671  (910.83 per sec.)
    queries:                             1093420 (18216.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      910.8284
    time elapsed:                        60.0234s
    total number of events:              54671

Latency (ms):
         min:                                    6.89
         avg:                                   35.12
         max:                                  277.79
         95th percentile:                       57.87
         sum:                              1920011.28

Threads fairness:
    events (avg/stddev):           1708.4688/14.79
    execution time (avg/stddev):   60.0004/0.01